// ignore_for_file: public_member_api_docs, sort_constructors_first
import 'zakrTitleAndFavorModel.dart';

class ZakrModel {
  String contentTitle;
  String contentSubTitle;
  int originalCounter;
  int counter;
  ZakrModel({
    required this.contentTitle,
    required this.contentSubTitle,
    required this.counter,
  }) : originalCounter = counter;
}

List<List<dynamic>> usedListViewInsideDetails = [];
List<ZakrTitleAndFavor> titleAndFavor =
    List.generate(85, (index) => ZakrTitleAndFavor());
List<List<dynamic>> zakrMainList = [
  [
    titleAndFavor[0].title = 'فضل ذكر الله',
    titleAndFavor[0].isFavor,
    [
      ZakrModel(
        contentTitle:
            'عن أبي الدرداء قال: قال رسول الله صلى الله عليه وسلم: ألا أُنبئكم بخير أعمالكم وأزكاها عند مليككم، وأرفعها في درجاتكم، وخيرٌ لكم من إنفاق الذهب والوَرِق، وخيرٌ لكم من أن تلقوا عدوَّكم، فتضربوا أعناقهم ويضربوا أعناقكم، قالوا: بلى يا رسول الله، قال: ذكر الله',
        contentSubTitle: 'رواه الترمذي وابن ماجه، وصححه الألباني',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'وعن عبدالله بن بُسر رضي الله عنه أن رجلًا قال: يا رسول الله، إن شرائع الإسلام قد كثُرت علي، فأخبرني بشيء أتشبث به، قال: لا يزال لسانك رطبًا من ذكر الله',
        contentSubTitle: 'رواه الترمذي وصححه الألباني',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: سبَق المفردون، قالوا: وما المفردون يا رسول الله، قال: الذاكرون الله كثيرًا والذاكرات',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'وعن أبي موسى الأشعري رضي الله عنه عن النبي صلى الله عليه وسلم قال: مثلُ الذي يذكُر ربَّه والذي لا يذكر ربَّه، مثلُ الحي والميت',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'وعن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: من قعد مقعدًا لم يذكر الله تعالى فيه، كانت عليه من الله تعالى ترةٌ، ومن اضطجع مضجعًا لا يذكر الله تعالى فيه، كانت عليه من الله ترةٌ',
        contentSubTitle:
            'أخرجه أبو داود وصححه الألباني ,والترة هي الحسرة والندامة',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: يقول الله عز وجل: أنا عند ظن عبدي بي، وأنا معه حين يذكرني، إن ذكرني في نفسه ذكَرته في نفسي، وإن ذكرني في ملأ ذكرته في ملأ هم خيرٌ منهم، وإن تقرَّب مني شبرًا تقرَّبت إليه ذراعًا، وإن تقرب إلي ذراعًا تقربت منه باعًا، وإن أتاني يمشي أتيتُه هرولةً',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'وعن الحارث الأشعري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: إن الله أوحى إلى يحيى بن زكريا بخمس كلمات أن يعمل بهن ويأمر بني إسرائيل أن يعملوا بهن، فكأنه أبطأ بهن، فأتاه عيسى فقال: إن الله أمرك بخمس كلمات أن تعمل بهن وتأمر بني إسرائيل أن يعملوا بهن فإما أن تخبرهم وأما أن أخبرهم، فقال: يا أخي لا تفعل فإني أخاف إن سبقتني بهن أن يخسف بي أو أعذب، قال: فجمع بني إسرائيل ببيت المقدس حتى امتلأ المسجد وقعدوا على الشرفات ثم خطبهم فقال: إن الله أوحى إلي بخمس كلمات أن أعمل بهن وآمر بني إسرائيل أن يعملوا بهن أولاهن: لا تشركوا بالله شيئا فإن مثل من أشرك بالله كمثل رجل اشترى عبدا من خالص ماله بذهب أو ورق ثم أسكنه دارا فقال اعمل وارفع إلي، فجعل يعمل ويرفع إلى غير سيده! فأيكم يرضى أن يكون عبده كذلك! فإن الله خلقكم ورزقكم فلا تشركوا به شيئا، وإذا قمتم إلى الصلاة فلا تلتفتوا فإن الله يقبل بوجهه إلى وجه عبده ما لم يلتفت، وأمركم بالصيام ومثل ذلك كمثل رجل في عصابة معه صرة مسك كلهم يحب أن يجد ريحها وإن الصيام أطيب عند الله من ريح المسك. وأمركم بالصدقة ومثل ذلك كمثل رجل أسره العدو فأوثقوا يده إلى عنقه وقربوه ليضربوا عنقه فجعل يقول: هل لكم أن أفدي نفسي منكم؟ وجعل يعطي القليل والكثير حتى فدى نفسه، وأمركم بذكر الله كثيرا ومثل ذلك كمثل رجل طلبه العدو سراعا في أثره حتى أتى حصنا فأحرز نفسه فيه، وكذلك العبد لا ينجو من الشيطان إلا بذكر الله',
        contentSubTitle: 'رواه الترمذي وصححه الألباني',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن: سبحان الله وبحمده، سبحان الله العظيم',
        contentSubTitle: 'متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'و عن سمرة بن جندب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: أحب الكلام إلى الله تعالى أربع: سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر، لا يضرك بأيهن بدأت',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'و عن جويرية أم المؤمنين رضي الله عنها: أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح، وهي في مسجدها، ثم رجع بعد أن أضحى، وهي جالسة فيه، فقال: ما زلت اليوم على الحالة التي فارقتك عليها؟ قالت: نعم، فقال النبي صلى الله عليه وسلم: لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن: سبحان الله وبحمده عدد خلقه، ورضى نفسه، وزنة عرشه، ومداد كلماته',
        contentSubTitle: 'رواه مسلم',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'و عن أبي أيوب الأنصاري رضي الله عنه عن النبي صلى الله عليه وسلم قال: من قال لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير عشر مرات، كان كمن أعتق أربعة أنفس من ولد إسماعيل',
        contentSubTitle: 'متفق عليه',
        counter: 10,
      ),
      ZakrModel(
        contentTitle:
            'و عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: من قال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شئ قدير في يوم مائة مرة كانت له عدل عشر رقاب، وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزا من الشيطان يومه ذلك حتى يمسي، ولم يأت أحد بأفضل مما جاء به إلا رجل عمل أكثر منه وقال: ومن قال سبحان الله وبحمده في اليوم مائة مرة، حطت خطاياه وإن كانت مثل زبد البحر',
        contentSubTitle: 'متفق عليه',
        counter: 100,
      ),
      ZakrModel(
        contentTitle:
            'و عن سعد بن أبي وقاص رضي الله عنه قال: كنا عند رسول الله صلى الله عليه وسلم فقال: أيعجز أحدكم أن يكسب في كل يوم ألف حسنة؟ فسأله سائل من جلسائه: كيف يكسب ألف حسنة؟ قال: يسبح مائة تسبيحة فتكتب له ألف حسنة، أو تحط عنه ألف خطيئة',
        contentSubTitle: 'رواه مسلم',
        counter: 100,
      ),
      ZakrModel(
        contentTitle:
            'و عن جابر رضي الله عنه عن النبي صلى الله عليه وسلم قال: من قال سبحان الله وبحمده، غرست له نخلة في الجنة',
        contentSubTitle: 'رواه الترمذي وصححه الألباني',
        counter: 1,
      ),
    ]
  ],
  [
    titleAndFavor[1].title = 'أذكار الاستيقظ من النوم',
    titleAndFavor[1].isFavor,
    [
      ZakrModel(
        contentTitle: 'الحمد لله الذي أحيانا بعدما أماتنا وإليه النشور',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'الحمد لله الذي رد علي روحي، وعافاني في جسدي، وأذن لي بذكره',
        contentSubTitle: 'حسن رواه الترمذي',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'الله اكبر والحمد لله و سبحان الله وبحمده وسبحان القدوس واستغفر الله ولا إله إلا الله ثم قل: اللهم إني أعوذ بك من ضيق الدنيا وضيق يوم القيامة',
        contentSubTitle: 'صحيح رواه أبو داود والنسائي',
        counter: 10,
      ),
    ]
  ],
  [
    titleAndFavor[2].title = 'أذكار لبس ثوبه',
    titleAndFavor[2].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم إني أسألك من خيره وخير ما هو له، وأعوذ بك من شره وشر ما هو له',
        contentSubTitle:
            'كان النبي صلى الله عليه وسلم إذا لبس ثوبا سماه باسمه قميصا أو رداء أو عمامة ثم قال... ،صحيح رواه أبو داود والترمذي',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'الحمد لله الذي كساني هذا ورزقنه من غير حول مني ولا قوة',
        contentSubTitle:
            'عن معاذ بن أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: من لبس ثوبا جديدا فقال: الحمد لله الذي كساني هذا ورزقنه من غير حول مني ولا قوة، غفر الله له ما تقدم من ذنبه ،حسن رواه أبو داود',
        counter: 1,
      ),
    ]
  ],
  [
    titleAndFavor[3].title = 'ما يقول لصاحبه إذا رأى عليه ثوبا جديدا',
    titleAndFavor[3].isFavor,
    [
      ZakrModel(
        contentTitle: 'أبْلِ وأخْلِقِ',
        contentSubTitle:
            'رواه البخاري ،ومعناه البس الثياب حتى تتمزق ثم جددها وهو دعاء له يتضمن طول عمر الثوب وطول عمر اللابس',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'البس جديدا، وعش حميدا، ومِت شهيدا',
        contentSubTitle: 'صحيح رواه النسائي في عمل اليوم والليلة',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[4].title = 'أذكار الخروج من البيت',
    titleAndFavor[4].isFavor,
    [
      ZakrModel(
        contentTitle:
            'بسم الله توكلت على الله، اللهم إني أعوذ بك أن أضِلَّ أَوْ أُضَلَّ، أوْ أزِلَّ أَوْ أُزَلَّ، أَوْ أظْلِمَ أَوْ أُظْلَمَ، أوْ أجْهَلَ أَوْ يُجْهَلَ عليَّ',
        contentSubTitle: 'صحيح رواه أبو داود والترمذي',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'باسم الله، توكلت على الله، ولا حول ولا قوة إلا بالله',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم: من قال يعني إذا خرج من بيته: باسم الله، توكلت على الله، ولا حول ولا قوة إلا بالله، يقال له: هديت وكفيت ووقيت، وتنحى عنه الشيطان فيقول يعني الشيطان لشيطان آخر: كيف لك برجل قد هدي وكفي ووقي؟ ،صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[5].title = 'أذكار دخل البيت',
    titleAndFavor[5].isFavor,
    [
      ZakrModel(
        contentTitle: 'أذكر الله',
        contentSubTitle:
            'قال النبي صلى الله عليه وسلم : إذا دخل الرجل بيته فذكر الله تعالى عند دخوله وعند طعامه قال الشيطان : لا مبيت لكم ولا عشاء، وإذا دخل فلم يذكر الله تعالى عند دخوله، قال الشيطان : أدركتم المبيت، وإذا لم يذكر الله تعالى عند طعامه قال : أدركتم المبيت والعشاء ،رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[6].title = 'ما يقول إذا استيقظ من الليل يتهجد',
    titleAndFavor[6].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم ربنا لك الحمد، أنت قيُّومُ السموات والأرض ومن فيهن، ولك الحمد، لك ملك السموات والأرض ومن فيهن، ولك الحمد أنت نور السموات والأرض ومن فيهن، ولك الحمد أنت الحق، ووعدك الحق، ولقاؤك حق، وقولك حق، والجنة حق، والنار حق، ومحمد حق، والساعة حق، اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت، وبك خاصمت، وإليك حاكمت، فاغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت، أنت المقدم وأنت المؤخر، لا إله إلا أنت',
        contentSubTitle: 'متفق عليه',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[7].title = 'أذكار دخول الخلاء',
    titleAndFavor[7].isFavor,
    [
      ZakrModel(
        contentTitle: 'اللهم إني أعوذ بك من الخبث والخبائث',
        contentSubTitle: 'متفق عليه',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[8].title = 'أذكار الخروج من الخلاء',
    titleAndFavor[8].isFavor,
    [
      ZakrModel(
        contentTitle: 'غفرانك',
        contentSubTitle: 'صحيح رواه البخاري في الادب المفرد وأبو داود والترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[9].title = 'ما يقول بعد وضوئه',
    titleAndFavor[9].isFavor,
    [
      ZakrModel(
        contentTitle:
            'أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدا عبده ورسوله',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : من توضأ فقال... ، فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ،رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'اللهم اغفر لي ذنبي، ووسع لي في داري، وبارك لي في رزقي',
        contentSubTitle:
            'و عن أبي موسى الأشعري رضي الله عنه قال: أتيت رسول الله صلى الله عليه وسلم بوضوء، فتوضأ، فسمعته يدعو ويقول... فقلت: يا نبي الله سمعتك تدعو بكذا وكذا، قال: وهل تركن من شئ؟ ،حسن رواه النسائي في عمل اليوم والليلة',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[10].title = 'أذكار دخول المسجد والخروج منه',
    titleAndFavor[10].isFavor,
    [
      ZakrModel(
        contentTitle:
            'إذا دخل قال اللهم افتح لي أبواب رحمتك\n وإذا خرج قال اللهم إني أسألك من فضلك',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'أعوذ بالله العظيم وبوجهه الكريم وسلطانه القديم من الشيطان الرجيم',
        contentSubTitle:
            'وعن عبد الله بن عمرو بن العاص رضي الله عنهما عن النبي صلى الله عليه وسلم أنه كان إذا دخل المسجد يقول... قال: فإذا قال ذلك قال الشيطان: حفظ مني سائر اليوم ،صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[11].title = 'ما يقول من سمع المؤذن',
    titleAndFavor[11].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم رب هذه الدعوة التامة والصلاة القائمة، آت محمدا الوسيلة والفضيلة، وابعثه مقاما محمودا الذي وعدته',
        contentSubTitle:
            'وعن جابر بن عبد الله رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال : من قال حين يسمع النداء... حلت له شفاعتي يوم القيامة ،رواه البخاري',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'أشهد أن لا إله إلا الله وحده لا شريك له، وأن محمدا عبده ورسوله، رضيت بالله ربا، وبمحمد رسولا، وبالإسلام دينا',
        contentSubTitle:
            'وعن سعد بن أبي وقاص رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: من قال حين يسمع المؤذن... غفر له ذنبه ،رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'قال رسول الله صلى الله عليه وسلم : إذا سمعتم المؤذن فقولوا مثل ما يقول، ثم صلوا علي، فإنه من صلى علي صلاة صلى الله عليه بها عشرا، ثم سلوا الله لي الوسيلة، فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو، فمن سأل لي الوسيلة حلت له الشفاعة',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[12].title = 'ما يقول بعد تكبيرة الإحرام (دعاء الاستفتاح)',
    titleAndFavor[12].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس، اللهم اغسلني من خطاياي بالثلج والماء والبرد',
        contentSubTitle:
            'وعن أبي هريرة رضي الله عنه قال : كان رسول الله صلى الله عليه وسلم إذا كبر في الصلاة سكت هنية قبل أن يقرأ، فقلت : يا رسول الله بأبي أنت وأمي أرأيت سكوتك بين التكبير والقراءة ما تقول؟ قال أقول... ،متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'سبحانك اللهم وبحمدك، وتبارك اسمك، وتعالى جدك، ولا إله غيرك',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[13].title = 'أذكار الركوع',
    titleAndFavor[13].isFavor,
    [
      ZakrModel(
        contentTitle: 'سبحان ربي العظيم',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي',
        contentSubTitle: 'متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم لك ركعت، وبك آمنت، ولك أسلمت، خشع لك سمعي وبصري، ومخي وعظمي وعصبي',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبوح قدوس رب الملائكة والروح',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبحان ذي الجبروت والملكوت والكبرياء والعظمة',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[14].title = 'ما يقول إذا رفع رأسه من الركوع',
    titleAndFavor[14].isFavor,
    [
      ZakrModel(
        contentTitle:
            'يقول حين يرفع صلبه من الركوع : سمع الله لمن حمده\nثم يقول وهو قائم : ربنا لك الحمد',
        contentSubTitle: 'متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم ربنا لك الحمد، ملء السموات والأرض، وملء ما شئت من شئ بعد، أهل الثناء والمجد، أحق ما قال العبد، وكلنا لك عبد، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه',
        contentSubTitle:
            'وعن رفاعة بن رافع الزرقي رضي الله عنه قال : كنا يوما نصلي وراء النبي صلى الله عليه وسلم، فلما رفع رأسه من الرُّكوعِ قال : سمع الله لمن حمده، فقال رجل وراءه : ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه، فلما انصرف قال : من المتكلم؟  قال : أنا، قال : رأيت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أول ،رواه البخاري',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[15].title = 'أذكار السجود',
    titleAndFavor[15].isFavor,
    [
      ZakrModel(
        contentTitle: 'سبحان ربي الأعلي',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي',
        contentSubTitle: 'متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبوح قدوس رب الملائكة والروح',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبحان ذي الجبروت والملكوت والكبرياء والعظمة',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم لك سجدت، وبك آمنت، ولك أسلمت، سجد وجهي للذي خلقه وصوره، وشق سمعه وبصره، تبارك الله أحسن الخالقين',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم اغفر لي ذنبي كله دقه وجله، أوله وآخره، علانيته وسره',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[16].title = 'ما يقول بين السجدتين',
    titleAndFavor[16].isFavor,
    [
      ZakrModel(
        contentTitle: 'اللهم اغفر لي وارحمني وعافني واهدني وارزقني',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[17].title = 'ما يقول في القنوت',
    titleAndFavor[17].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت، وبارك لي فيما أعطيت، وقني شر ما قضيت، فإنك تقضي ولا يقضى عليك، إنه لا يذل من واليت، تباركت ربنا وتعاليت',
        contentSubTitle: 'صحيح رواه أبو داود والترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[18].title = 'ما يقول في التشهد في الصلاة',
    titleAndFavor[18].isFavor,
    [
      ZakrModel(
        contentTitle:
            'التحيات لله، والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله، وأشهد أن محمدا عبده ورسوله',
        contentSubTitle: 'متفق عليه ،يقال في التشهد الأول',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد',
        contentSubTitle: 'متفق عليه ،يقال هو والذي قبله في التشهد الأخير ',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[19].title = 'الدعاء بعد التشهد الأخير',
    titleAndFavor[19].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم إني أعوذ بك من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن شر فتنة المسيح الدجال',
        contentSubTitle: 'متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم اغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أسرفت، وما أنت أعلم به مني، أنت المقدم وأنت المؤخر، لا إله إلا أنت',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[20].title = 'ماذا يفعل من كلمه إنسان وهو في الصلاة',
    titleAndFavor[20].isFavor,
    [
      ZakrModel(
        contentTitle: 'يقول الرجل : سبحان الله\nوتصفق النساء',
        contentSubTitle:
            'متفق عليه ،والتصفيق هو ضرب إحدي اليدين بالاخري وهذا الفعل للتنبيه على شيء نابها في الصلاة',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[21].title = 'أذكار بعد الصلاة',
    titleAndFavor[21].isFavor,
    [
      ZakrModel(
        contentTitle:
            'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد',
        contentSubTitle: 'متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'أستغفر الله',
        contentSubTitle: 'رواه مسلم',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'اللهم أنت السلام ومنك السلام، تباركت يا ذا الجلال والإكرام',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير، لا حول ولا قوة إلا بالله، لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل، وله الثناء الحسن، لا إله إلا الله مخلصين له الدين ولو كره الكافرون',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبحان الله والحمد لله والله أكبر',
        contentSubTitle:
            'وعن أبي هريرة رضي الله عنه، أن فقراء المهاجرين أتوا رسول الله صلى الله عليه وسلم فقالوا: ذهب أهل الدثور بالدرجات العلى والنعيم المقيم، يصلون كما نصلي، ويصومون كما نصوم، ولهم فضل من أموال يحجون بها ويعتمرون ويجاهدون ويتصدقون، فقال: ألا أعلمكم شيئا تدركون به من سبقكم وتسبقون به من بعدكم، ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم؟ قالوا: بلى يارسول الله قال: تسبحون وتحمدون وتكبرون خلف كل صلاة ثلاثا وثلاثين ،متفق عليه ،وأهل الدثور هم أصحاب المال الكثير',
        counter: 33,
      ),
      ZakrModel(
        contentTitle:
            'سبحان الله والحمد لله والله أكبر\nوتمام المئة لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير',
        contentSubTitle:
            'وعن أبي هريرة رضي الله عنه، عن رسول الله صلى الله عليه وسلم قال: من سبح الله في دبر كل صلاة ثلاثا وثلاثين، وحمد الله ثلاثا وثلاثين، وكبر الله ثلاثا وثلاثين، وقال تمام المائة: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير، غفرت خطاياه وإن كانت مثل زبد البحر ،رواه مسلم',
        counter: 33,
      ),
      ZakrModel(
        contentTitle:
            'اللهم إني أعوذ بك من الجبن، وأعوذ بك أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'قراءة سورة الإخلاص وسورة الفلق وسورة الناس',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'اللهم أعني على ذكرك وشكرك وحسن عبادتك',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'اللهم إني أعوذ بك من الكفر والفقر وعذاب القبر',
        contentSubTitle: 'صحيح رواه البخاري في الادب المفرد',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[22].title = 'أذكار الصباح',
    titleAndFavor[22].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت',
        contentSubTitle:
            'وعن شداد بن أوس رضي الله عنه، عن النبي صلى الله عليه وسلم قال: سيد الاستغفار... إذا قال ذلك حين يمسي فمات من ليلته دخل الجنة، أو كان من أهل الجنة، وإذا قال ذلك حين يصبح فمات من يومه ... مثله ،رواه البخاري ومعنى أبوء: أقر وأعترف',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبحان الله وبحمده',
        contentSubTitle:
            'عن أبي هريرة رضي الله عنه، قال: قال رسول الله صلى الله عليه وسلم: من قال حين يصبح وحين يمسي: سبحان الله وبحمده مائة مرة لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه ،رواه مسلم',
        counter: 100,
      ),
      ZakrModel(
        contentTitle: 'قراءة سورة الإخلاص وسورة الفلق وسورة الناس',
        contentSubTitle: 'حسن رواه أبو داود',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'اللهم بك أصبحنا وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور',
        contentSubTitle: 'صحيح رواه البخاري في الأدب المفرد',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شئ قدير، رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل وسوء الكبر،رب أعوذ بك من عذاب في النار وعذاب في القبر',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'أعوذ بكلمات الله التامات من شر ما خلق',
        contentSubTitle:
            'عن أبي هريرة رضي الله عنه قال: جاء رجل إلى النبي صلى الله عليه وسلم فقال: يا رسول الله ما لقيت من عقرب لدغتني البارحة؟ قال: أما لو قلت حين أمسيت: أعوذ بكلمات الله التامات من شر ما خلق لم تضرك ،رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'قل: اللهم فاطر السموات والأرض، عالم الغيب والشهادة رب كل شئ ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي وشر الشيطان وشركه',
        contentSubTitle: 'صحيح رواه البخاري في الأدب المفرد',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'بسم الله الذي لا يضر مع اسمه شئ في الأرض ولا في السماء وهو السميع العليم',
        contentSubTitle:
            'عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ما من عبد يقول في صباح كل يوم ومساء كل ليلة: بسم الله الذي لا يضر مع اسمه شئ في الأرض ولا في السماء وهو السميع العليم، ثلاث مرات لم يضره شئ ،صحيح رواه البخاري في الأدب المفرد',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي',
        contentSubTitle: 'صحيح رواه البخاري في الأدب المفرد',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم: من قال إذا أصبح... كان له عدل رقبة من ولد إسماعيل صلى الله عليه وسلم، وكتب له عشر حسنات، وحط عنه عشر سيئات، ورفع له عشر درجات، وكان في حرز من الشيطان حتى يمسي، وإن قالها إذا أمسى كان له مثل ذلك حتى يصبح ،صحيح رواه أبو داود',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت',
        contentSubTitle: 'حسن رواه البخاري في الأدب المفرد',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'أصبحنا على فطرة الإسلام، وكلمة الإخلاص، ودين نبيا محمد صلى الله عليه وسلم، وملة أبينا إبراهيم صلى الله عليه وسلم حنيفا مسلما وما أنا من المشركين',
        contentSubTitle: 'صحيح رواه النسائي في عمل اليوم والليلة',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'يا حي يا قيوم بك أستغيث فأصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين',
        contentSubTitle: 'حسن رواه النسائي في عمل اليوم والليلة',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا',
        contentSubTitle: 'صحيح رواه النسائي في الكبري',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[23].title = 'أذكار المساء',
    titleAndFavor[23].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت',
        contentSubTitle:
            'وعن شداد بن أوس رضي الله عنه، عن النبي صلى الله عليه وسلم قال: سيد الاستغفار... إذا قال ذلك حين يمسي فمات من ليلته دخل الجنة، أو كان من أهل الجنة، وإذا قال ذلك حين يصبح فمات من يومه ... مثله ،رواه البخاري ومعنى أبوء: أقر وأعترف',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبحان الله وبحمده',
        contentSubTitle:
            'عن أبي هريرة رضي الله عنه، قال: قال رسول الله صلى الله عليه وسلم: من قال حين يصبح وحين يمسي: سبحان الله وبحمده مائة مرة لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه ،رواه مسلم',
        counter: 100,
      ),
      ZakrModel(
        contentTitle: 'قراءة سورة الإخلاص وسورة الفلق وسورة الناس',
        contentSubTitle: 'حسن رواه أبو داود',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'اللهم بك أمسينا وبك أصبحنا، وبك نحيا، وبك نموت، وإليك المصير',
        contentSubTitle: 'صحيح رواه البخاري في الأدب المفرد',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شئ قدير، رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل وسوء الكبر،رب أعوذ بك من عذاب في النار وعذاب في القبر',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'أعوذ بكلمات الله التامات من شر ما خلق',
        contentSubTitle:
            'عن أبي هريرة رضي الله عنه قال: جاء رجل إلى النبي صلى الله عليه وسلم فقال: يا رسول الله ما لقيت من عقرب لدغتني البارحة؟ قال: أما لو قلت حين أمسيت: أعوذ بكلمات الله التامات من شر ما خلق لم تضرك ،رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'قل: اللهم فاطر السموات والأرض، عالم الغيب والشهادة رب كل شئ ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي وشر الشيطان وشركه',
        contentSubTitle: 'صحيح رواه البخاري في الأدب المفرد',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'بسم الله الذي لا يضر مع اسمه شئ في الأرض ولا في السماء وهو السميع العليم',
        contentSubTitle:
            'عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ما من عبد يقول في صباح كل يوم ومساء كل ليلة: بسم الله الذي لا يضر مع اسمه شئ في الأرض ولا في السماء وهو السميع العليم، ثلاث مرات لم يضره شئ ،صحيح رواه البخاري في الأدب المفرد',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي',
        contentSubTitle: 'صحيح رواه البخاري في الأدب المفرد',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم: من قال إذا أصبح... كان له عدل رقبة من ولد إسماعيل صلى الله عليه وسلم، وكتب له عشر حسنات، وحط عنه عشر سيئات، ورفع له عشر درجات، وكان في حرز من الشيطان حتى يمسي، وإن قالها إذا أمسى كان له مثل ذلك حتى يصبح ،صحيح رواه أبو داود',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت',
        contentSubTitle: 'حسن رواه البخاري في الأدب المفرد',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'يا حي يا قيوم بك أستغيث فأصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين',
        contentSubTitle: 'حسن رواه النسائي في عمل اليوم والليلة',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[24].title = 'ما يقول بعد صلاة الوتر',
    titleAndFavor[24].isFavor,
    [
      ZakrModel(
        contentTitle: 'سبحان الملك القدوس',
        contentSubTitle: 'صحيح رواه أبو داود والنسائي',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'اللهم إني أعوذ برضاك من سخطك، وأعوذ بمعافاتك من عقوبتك، وأعوذ بك منك، لا أحصي ثناء عليك أنت كما أثنيت على نفسك',
        contentSubTitle: 'صحيح رواه أبو داود والترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[25].title = 'أذكار النوم',
    titleAndFavor[25].isFavor,
    [
      ZakrModel(
        contentTitle:
            'توضأ ثم نم علي جمبك الأيمن ثم قل اللهم أسلمت نفسي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك، آمنت بكتابك الذي أنزلت، ونبيك الذي أرسلت',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم: إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن وقل... فإن مت مت على الفطرة، واجعلهن آخر ما تقول ،متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'أنفض السرير ثلاثا ثم قل : باسمك ربي وضعت جنبي وبك أرفعه، إن أمسكت نفسي فارحمها، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم: إذا أوى أحدكم إلى فراشه، فلينفض فراشه بداخلة إزاره، فإنه لا يدري ما خلفه عليه، ثم يقول... ،متفق عليه وفي رواية: ينفضه ثلاث مرات',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'ضع يدك اليمني تحت خدك الايمن ثم قل اللهم قِني عذابك يوم تبعث عبادك',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'أجمع كفيك ثم انفث فيهما ثم أقرأ سورة الإخلاص وسورة الفلق وسورة الناس ثم امسح بهما ما أستطعت من جسدك وأبدا من الرأس والوجه',
        contentSubTitle: 'متفق عليه ،والنفث: نفخ لطيف بلا ريق',
        counter: 3,
      ),
      ZakrModel(
        contentTitle: 'باسمك اللهم أحيا وأموت',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'سبحان الله والحمد لله والله أكبر',
        contentSubTitle: 'متفق عليه',
        counter: 33,
      ),
      ZakrModel(
        contentTitle:
            'أعوذ بالله من الشيطان الرجيم بسم الله الرحمن الرحيم\nآمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير (٢٨٥) لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين (٢٨٦) سورة البقرة',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم: الآيتان من آخر سورة البقرة، من قرأ بهما في ليلة كفتاه ،متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'أعوذ بالله من الشيطان الرجيم بسم الله الرحمن الرحيم\nالله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يئوده حفظهما وهو العلي العظيم (٢٥٥) سورة البقرة',
        contentSubTitle:
            'قال النبي صلى الله عليه وسلم: إذا أويت إلى فراشك فاقرأ آية الكرسي، فإنه لن يزال معك من الله تعالى حافظ، ولا يقربك شيطان حتى تصبح ،رواه البخاري',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم رب السموات ورب الأرض ورب العرش العظيم، ربنا ورب كل شئ، فالق الحب والنوى، منزل التوراة والإنجيل والقرآن، أعوذ بك من شر كل ذي شر أنت آخذ بناصيته، أنت الأول فليس قبلك شئ، وأنت الآخر فليس بعدك شئ، وأنت الظاهر فليس فوقك شئ، وأنت الباطن فليس دونك شئ، اقض عنا الدين، وأغننا من الفقر',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'الحمد لله الذي أطعمنا وسقانا وكفانا وآوَانا، فكم ممن لا كافِيَ له، ولا مُؤْوِيَ',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[26].title = 'ما يقول إذا استيقظ في الليل وأراد النوم بعده',
    titleAndFavor[26].isFavor,
    [
      ZakrModel(
        contentTitle:
            'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير، والحمد لله، وسبحان الله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم: من تعار من الليل فقال... ثم قال: اللهم اغفر لي أو دعا، استُجيب له، فإن توضأ قبلت صلاته ،رواه البخاري',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'لا إله إلا الله الواحد القهار، رب السموات والأرض وما بينهما العزيز الغفار',
        contentSubTitle: 'صحيح رواه النسائي في الكبري',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[27].title = 'ما يقول إذا كان يفزع في منامه',
    titleAndFavor[27].isFavor,
    [
      ZakrModel(
        contentTitle:
            'أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون',
        contentSubTitle: 'حسن رواه أبو داود والترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[28].title = 'ما يقول إذا رأى في منامه ما يكره',
    titleAndFavor[28].isFavor,
    [
      ZakrModel(
        contentTitle: 'ينفث عن يساره ثلاثا، وليتعوذ من الشيطان',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : الرؤيا الصالحة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن يساره ثلاثا، وليتعوذ من الشيطان، فإنها لا تضره ،متفق عليه\nوالنفث هو نفخ لطيف لا ريق معه',
        counter: 3,
      ),
    ],
  ],
  [
    titleAndFavor[29].title =
        'أمر من ذُكر عنده النبي صلى الله عليه وسلم بالصلاة عليه والتسليم',
    titleAndFavor[29].isFavor,
    [
      ZakrModel(
        contentTitle: 'اللهم صل وسلم علي نبينا محمد',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : رغم أنف رجل ذكرت عنده فلم يصل علي ،صحيح رواه الترمذي وقال رسول الله صلى الله عليه وسلم : البخيل من ذُكرت عنده، فلم يصل علي ،صحيح رواه الترمذي وأحمد',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[30].title = 'دعاء الاستخارة',
    titleAndFavor[30].isFavor,
    [
      ZakrModel(
        contentTitle:
            'صلي ركعتين من غير الفريضة ثم قل اللهم إني أستخيرك بعلمك، وأستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تقدر ولا أقدر، وتعلم ولا أعلم، وأنت علام الغيوب، اللهم إن كنت تعلم أن هذا الأمر خير لي في ديني ومعاشي وعاقبة أمري فاقدره لي ويسره لي، ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري فاصرفه عني واصرفني عنه واقدر لي الخير حيث كان ثم رضني به، قال : ويسمي حاجته',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[31].title = 'دعاء الكرب والدعاء عند الأمور المهمة',
    titleAndFavor[31].isFavor,
    [
      ZakrModel(
        contentTitle:
            'لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات ورب الأرض ورب العرش الكريم',
        contentSubTitle: 'متفق عليه',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[32].title = 'ما يقول إذا راعه شئ أو فزع',
    titleAndFavor[32].isFavor,
    [
      ZakrModel(
        contentTitle: 'هو الله، الله ربي لا شريك له',
        contentSubTitle: 'صحيح رواه النسائي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[33].title = 'ما يقول إذا أصابه هم أو حزن',
    titleAndFavor[33].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم إني عبدك، ابن عبدك، ابن أمتِك، ناصيتي بيدك، ماض في حكمك، عدل في قضاؤك، أسألك بكل اسم هو لك، سميت به نفسك، أو أنزلته في كتابك، أو علمته أحدا من خلقك، أو استأثرت به في علم الغيب عندك أن تجعل القرآن نور صدري، وربيع قلبي، وجلاء حزني، وذهاب همي',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : من أصابه هم أو حزن فليدع بهذه الكلمات، يقول... ، فقال رجل من القوم : يا رسول الله إن المغبون لمن غبن في هؤلاء الكلمات، فقال : أجل فقولوهن وعلموهن، فإنه من قالهن الْتِماسَ ما فيهن أذهب الله تعالى حزنه، وأطال فرحه ،حسن رواه ابن السني',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[34].title = 'ما يقول إذا خاف قوما',
    titleAndFavor[34].isFavor,
    [
      ZakrModel(
        contentTitle: 'اللهم إنا نجعلك في نحورهم، ونعوذ بك من شرورهم',
        contentSubTitle: 'صحيح رواه أبو داود والنسائي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[35].title = 'ما يقول إذا حدث له أمر علي غير ما أراد',
    titleAndFavor[35].isFavor,
    [
      ZakrModel(
        contentTitle: 'قدر الله وما شاء فعل',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : المؤمن القوي خير وأحب إلى الله تعالى من المؤمن الضعيف، وفي كل خير، احرص على ما ينفعك، واستعن بالله ولا تعجزن، وإن أصابك شئ فلا تقل : لو أني فعلت كان كذا وكذا، ولكن قل : قدر الله وما شاء فعل فإن لو تفتح عمل الشيطان ،رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[36].title = 'ما يقول إذا استصعب عليه أمر',
    titleAndFavor[36].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم لا سهل إلا ما جعلته سهلا، وأنت تجعل الحزن إذا شئت سهلا',
        contentSubTitle: 'صحيح رواه ابن السني',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[37].title = 'ما يقول إذا كان عليه دين عجز عنه',
    titleAndFavor[37].isFavor,
    [
      ZakrModel(
        contentTitle: 'اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك',
        contentSubTitle:
            'عن علي رضي الله عنه، أن مكاتبا جاءه فقال : إني عجزت عن كتابتي فأعني، قال : ألا أعلمك كلمات علمنيهن رسول الله صلى الله عليه وسلم، لو كان عليك مثل جبل دينا أداه عنك؟ قال قل... ،حسن رواه الترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[38].title = 'ما يقول من بُلي بالوسوسة',
    titleAndFavor[38].isFavor,
    [
      ZakrModel(
        contentTitle: 'أعوذ بالله من الشيطان الرجيم',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : يأتي الشيطان أحدكم فيقول : من خلق كذا؟ من خلق كذا؟ حتى يقول : من خلق ربك؟ فإذا بلغ ذلك فليستعذ بالله ولينته ،متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'عن عثمان بن أبي العاص رضي الله عنه، قال : قلت يا رسول الله إن الشيطان قد حال بيني وبين صلاتي وقراءتي يلبسها علي، فقال رسول الله صلى الله عليه وسلم : ذلك شيطان يقال له : خنزب، فإذا أحسسته فتعوذ بالله منه واتفل عن يسارك ثلاثا ففعلت ذلك فأذهبه الله عني',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[39].title = 'ما يقال في الرقية',
    titleAndFavor[39].isFavor,
    [
      ZakrModel(
        contentTitle:
            'أعوذ بالله من الشيطان الرجيم\nبسم الله الرحمن الرحيم * الحمد لله رب العالمين * الرحمن الرحيم * مالك يوم الدين * إياك نعبد وإياك نستعين * اهدنا الصراط المستقيم * صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين',
        contentSubTitle:
            'حديث أبي سعيد الخدري رضي الله عنه مع اللديغ ،متفق عليه',
        counter: 7,
      ),
      ZakrModel(
        contentTitle:
            'اللهم رب الناس، مذهب البأس، اشف أنت الشافي، لا شافي إلا أنت، شفاء لا يغادر سقما',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[40].title = 'ما يقول إذا خاف من إصابه العين',
    titleAndFavor[40].isFavor,
    [
      ZakrModel(
        contentTitle:
            'أعوذ بكلمات الله التامة، من كل شيطان وهامة، ومن كل عين لامة',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[41].title = 'ما يقول المريض ويُقال عنده ويُقرأ عليه',
    titleAndFavor[41].isFavor,
    [
      ZakrModel(
        contentTitle:
            'أجمع كفيك ثم انفث فيهما ثم أقرأ سورة الإخلاص وسورة الفلق وسورة الناس ثم امسح بهما ما أستطعت من جسدك وأبدا من الرأس والوجه',
        contentSubTitle: 'متفق عليه ،والنفث: نفخ لطيف بلا ريق',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'اللهم رب الناس أذهب البأس، اشف أنت الشافي، لا شفاء إلا شفاؤك شفاء لا يغادر سقما',
        contentSubTitle:
            'عن عائشة رضي الله عنها، أن النبي صلى الله عليه وسلم كان يُعَوِّذُ بعض أهله، يمسح بيده اليمنى ويقول... ،متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'ضع يدك على الذي تَألم من جسدك، وقل: بسم الله',
        contentSubTitle: 'رواه مسلم',
        counter: 3,
      ),
      ZakrModel(
        contentTitle:
            'ضع يدك على الذي تَألم من جسدك، وقل: أعوذ بعزة الله وقدرته من شر ما أجد وأُحاذر',
        contentSubTitle: 'رواه مسلم',
        counter: 7,
      ),
      ZakrModel(
        contentTitle: 'أسأل الله العظيم رب العرش العظيم أن يشفيك',
        contentSubTitle:
            'عن ابن عباس رضي الله عنهما، عن النبي صلى الله عليه وسلم قال: من عاد مريضا لم يحضر أجله، فقال عنده: سبع مرات: أسأل الله العظيم رب العرش العظيم أن يشفيك، إلا عافاه الله سبحانه وتعالى من ذلك المرض ،صحيح رواه أبو داود',
        counter: 7,
      ),
      ZakrModel(
        contentTitle: 'اللهم اشف عبدك ينكأ لك عدوا، أو يمشي لك إلى صلاة',
        contentSubTitle: 'صحيح راوه أبو داود',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'لا إله إلا الله والله أكبر، لا إله إلا الله وحده لا شريك له، لا إله إلا الله له الملك وله الحمد، لا إله إلا الله ولا حول ولا قوة إلا بالله',
        contentSubTitle:
            'عن أبي سعيد الخدري وأبي هريرة رضي الله عنهما، أنهما شهدا على رسول الله صلى الله عليه وسلم أنه قال: من قال لا إله إلا الله والله أكبر، صدقه ربه، فقال: لا إله إلا أنا وأنا أكبر، وإذا قال: لا إله إلا الله وحده لا شريك له، قال: يقول: لا إله إلا أنا وحدي لا شريك لي، وإذا قال: لا إله إلا الله له الملك وله الحمد، قال: لا إله إلا أنا لي الملك ولي الحمد، وإذا قال: لا إله إلا الله ولا حول ولا قوة إلا بالله، قال: لا إله إلا أنا ولا حول ولا قوة إلا بي " وكان يقول " من قالها في مرضه ثم مات لم تطعمه النار ،صحيح رواه الترمذي',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'بسم الله أرقيك، من كل شئ يؤذيك، من شر كل نفس أو عين حاسد، الله يشفيك، بسم الله أرقيك',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'لا بأس طَهور إن شاء الله',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'بسم الله تربة أرضنا بريقة بعضنا يشفى به سقيمنا بإذن ربنا',
        contentSubTitle:
            'عن عائشة رضي الله عنها، أن النبي صلى الله عليه وسلم كان إذا اشتكى الإنسان الشئ منه، أو كانت قرحة أو جرح، قال النبي صلى الله عليه وسلم بإصبعه هكذا، ووضع سفيان بن عيينة الراوي سبابته بالأرض، ثم رفعها وقال... ،متفق عليه',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[42].title =
        'كراهية تمني الموت لضر نزل بالإنسان وجوازه إذا خاف فتنة في دينه',
    titleAndFavor[42].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم أحيني ما كانت الحياة خيرا لي، وتوفني إذا كانت الوفاة خيرا لي',
        contentSubTitle:
            'قال النبي صلى الله عليه وسلم: لا يتمنين أحدكم الموت من ضر أصابه، فإن كان لا بد فاعلا فليقل... ،متفق عليه',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[43].title = 'ما يقول عند الموت',
    titleAndFavor[43].isFavor,
    [
      ZakrModel(
        contentTitle: 'لا إله إلا الله',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : من كان آخر كلامه لا إله إلا الله دخل الجنة ،صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[44].title = 'ما يقول بعد تغميض الميت',
    titleAndFavor[44].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم اغفر له، وارفع درجته في المهديين، واخلفه في عقبه في الغابرين، واغفر لنا وله يا رب العالمين، وافسح في قبره ونور له فيه',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[45].title = 'ما يقول من مات له ميت',
    titleAndFavor[45].isFavor,
    [
      ZakrModel(
        contentTitle:
            'إنا لله وإنا إليه راجعون، اللهم أجرني في مصيبتي، وأخلف لي خيرا منها',
        contentSubTitle:
            'عن أم سلمة رضي الله عنها قالت : سمعت رسول الله صلى الله عليه وسلم يقول : ما من عبد تصيبه مصيبة فيقول إنا لله وإنا إليه راجعون، اللهم أجرني في مصيبتي، وأخلف لي خيرا منها إلا أجره الله تعالى في مصيبته وأخلف له خيرا منها، قالت : فلما توفي أبو سلمة، قلت كما أمرني رسول الله صلى الله عليه وسلم، فأخلف الله تعالى لي خيرا منه : رسول الله صلى الله عليه وسلم ،رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'وقال رسول الله صلى الله عليه وسلم : إذا مات ولد العبد قال الله تعالى لملائكته : قبضتم ولد عبدي؟ فيقولون نعم، فيقول : قبضتم ثمرة فؤاده؟ فيقولون: نعم، فيقول : فماذا قال عبدي؟ فيقولون: حمدك واسترجع، فيقول الله تعالى : ابنوا لعبدي بيتا في الجنة وسموه بيت الحمد',
        contentSubTitle:
            'حسن رواه الترمذي ،ومعني حمدك واسترجع اي قال : الحمد لله، إنا لله وإنا إليه راجعون',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[46].title = 'الدعاء في الصلاة على الميت',
    titleAndFavor[46].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم اغفر له، وارحمه، وعافه، واعف عنه، وأكرم نزله، ووسع مدخله، واغسله بالماء والثلج والبرد، ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس، وأبدله دارا خيرا من داره، وأهلا خيرا من أهله، وزوجا خيرا من زوجه، وأدخله الجنة، وأعذه من عذاب القبر أو من عذاب النار',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم اغفر لحينا وميتنا، وصغيرنا وكبيرنا، وذكرنا وأنثانا، وشاهدنا وغائبنا، اللهم من أحييته منا فأحيه على الإسلام، ومن توفيته منا فتوفه على الإيمان، اللهم لا تحرمنا أجره ولا تفتنا بعده',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[47].title = 'ما يقوله من يدخل الميت قبره',
    titleAndFavor[47].isFavor,
    [
      ZakrModel(
        contentTitle: 'بسم الله، وعلى سنة رسول الله صلى الله عليه وسلم',
        contentSubTitle: 'صحيح رواه أبو داود والترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[48].title = 'ما يقول بعد الدفن',
    titleAndFavor[48].isFavor,
    [
      ZakrModel(
        contentTitle: 'اللهم أغفر له اللهم ثبته عند السؤال',
        contentSubTitle:
            'عن عثمان رضي الله عنه، قال : كان النبي صلى الله عليه وسلم إذا فرغ من دفن الميت، وقف عليه فقال : استغفروا لأخيكم، وسألوا الله له التثبيت فإنه الآن يسأل ،صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[49].title = 'ما يقول زائر القبور',
    titleAndFavor[49].isFavor,
    [
      ZakrModel(
        contentTitle:
            'السلام على أهل الديار من المؤمنين والمسلمين، ويرحم الله المستقدمين منكم ومنا المستأخرين، وإنا إن شاء الله بكم لاحقون',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[50].title = 'الأذكار في العشر الأول من ذي الحجة',
    titleAndFavor[50].isFavor,
    [
      ZakrModel(
        contentTitle:
            'لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شئ قدير',
        contentSubTitle: 'حسن رواه الترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[51].title = 'الأذكار في الكسوف',
    titleAndFavor[51].isFavor,
    [
      ZakrModel(
        contentTitle: 'ادعوا الله تعالى وكبروا وتصدقوا',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : إن الشمس والقمر آيتان من آيات الله لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فادعوا الله تعالى وكبروا وتصدقوا ،متفق عليه',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[52].title = 'الأذكار في الاستسقاء',
    titleAndFavor[52].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللَّهُمَّ اسْقِنا غَيْثاً مُغِيثاً مَرِيّاً سَرِيعاً نافعاً غَيْرَ ضَارّ، عاجِلاً غَيْرَ آجِلٍ',
        contentSubTitle:
            'صحيح رواه أبو داود ،غيثا : أي مطرا، مغيثاً : أي معينا، مريئاً : أي هنيئاً صالحاً',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[53].title = 'ما يقول إذا هاجت الريح',
    titleAndFavor[53].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم إني أسألك خيرها وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[54].title = 'ما يقول إذا نزل المطر',
    titleAndFavor[54].isFavor,
    [
      ZakrModel(
        contentTitle: 'اللهم صيبا نافعا',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[55].title = 'ما يقول إذا كثر المطر وخيف منه الضرر',
    titleAndFavor[55].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم حوالينا ولا علينا، اللهم على الآكام والجبال والآجام، والظراب والأودية ومنابت الشجر',
        contentSubTitle:
            'متفق عليه ،الآكام: هي كل ما ارتفع من الأرض، الآجام: الحصون، الظراب: هو الجبل الصغير',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[56].title = 'ما يقول إذا رأى الهلال',
    titleAndFavor[56].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم أهله علينا باليمن والإيمان والسلامة والإسلام ربي وربك الله',
        contentSubTitle: 'صحيح رواه الترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[57].title = 'ما يقول إذا رأى القمر',
    titleAndFavor[57].isFavor,
    [
      ZakrModel(
        contentTitle: 'أعوذ بالله من شر هذا الغاسق إذا وقب',
        contentSubTitle: 'صحيح رواه الترمذي ،الغاسق إذا وقب : أي الليل إذا أظلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[58].title = 'ما يقول عند الإفطار',
    titleAndFavor[58].isFavor,
    [
      ZakrModel(
        contentTitle: 'ذهب الظمأ، وابتلت العروق، وثبت الأجر إن شاء الله تعالى',
        contentSubTitle: 'حسن رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[59].title = 'ما يقول إذا أفطر عند قوم',
    titleAndFavor[59].isFavor,
    [
      ZakrModel(
        contentTitle:
            'أفطر عندكم الصائمون، وأكل طعامكم الأبرار وصلت عليكم الملائكة',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[60].title = 'ما يَدعُو به إذا صادف ليلة القدر',
    titleAndFavor[60].isFavor,
    [
      ZakrModel(
        contentTitle: 'اللهم إنك عفو تحب العفو فاعف عني',
        contentSubTitle: 'صحيح رواه الترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[61].title = 'أذكار الخروج للسفر',
    titleAndFavor[61].isFavor,
    [
      ZakrModel(
        contentTitle: 'أستودعكم الله الذي لا تضيع ودائعه',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم من أراد أن يسافر فليقل لمن يخلف... ،صحيح رواه النسائي',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'أستودع الله دينك وأمانتك وخواتيم عملك',
        contentSubTitle: 'صحيح رواه الترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[62].title = 'ما يقول إذا ركب خارجا الي سفر',
    titleAndFavor[62].isFavor,
    [
      ZakrModel(
        contentTitle:
            'كبر ثلاثا، ثم قل: سبحان الذي سخر لنا هذا وما كنا له مقرنين، وإنا إلى ربنا لمنقلبون اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ما ترضى، اللهم هون علينا سفرنا هذا، واطو عنا بعده، اللهم أنت الصاحب في السفر والخليفة في الأهل، اللهم إني أعوذ بك من وَعْثاءِ السفر، وكآبة المنظر، وسوء المنقلب في المال والأهل\n وإذا رجع قالهن، وزاد فيهن : آيبون تائبون عابدون لربنا حامدون',
        contentSubTitle:
            'رواه مسلم ،وعثاء السفر : أي مشقته، آيبون : أي راجعون بالخير',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[63].title = 'تكبير المسافر إذا صعد وتسبيحه إذا هَبط',
    titleAndFavor[63].isFavor,
    [
      ZakrModel(
        contentTitle: 'إذا صعد قال الله أكبر\nوإذا هبط قال سبحان الله',
        contentSubTitle:
            'رواه البخاري ،والحكمه في ذلك أن العالي على الشيء قد يتعاظم في نفسه، فيرى أنه كبير، فكان من المناسب أن يكبر الله عز وجل فيقول: الله أكبر، وأما إذا نزل فالنزول سفول فناسب أن يسبح الله عز وجل عند السفول',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[64].title = 'ما يقول إذا رأى قرية يريد دخولها',
    titleAndFavor[64].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم رب السموات السبع وما أظللن، ورب الأراضين السبع وما أقللن، ورب الشياطين وما أضللن، ورب الرياح وما ذرين، أسألك خير هذه القرية وخير أهلها وخير ما فيها، ونعوذ بك من شرها وشر أهلها وشر ما فيها',
        contentSubTitle:
            'صحيح رواه النسائي ،أقللن : أي ما حملته على ظهرها من الناس والدواب والأشجار وغير ذلك، ذرين : أي أطارته',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[65].title = 'ما يقول إذا نزل منزلا',
    titleAndFavor[65].isFavor,
    [
      ZakrModel(
        contentTitle: 'أعوذ بكلمات الله التامات من شر ما خلق',
        contentSubTitle: 'رواه مسلم',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[66].title = 'التسمية عند الأكل والشرب',
    titleAndFavor[66].isFavor,
    [
      ZakrModel(
        contentTitle: 'قل بسم الله وكل باليمين وكل من أمامك',
        contentSubTitle:
            'عن عمر بن أبي سلمة رضي الله عنهما قال : قال لي رسول الله صلى الله عليه وسلم : سم الله، وكل بيمينك وكل مما يليك ،متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'وقال رسول الله صلى الله عليه وسلم : إذا أكل أحدكم فليذكر اسم الله تعالى في أوله، فإن نسي أن يذكر اسم الله تعالى في أوله فليقل : بسم الله أوله وآخره',
        contentSubTitle: 'صحيح رواه أبو داود والترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[67].title = 'ما يقول إذا فرغ من الطعام',
    titleAndFavor[67].isFavor,
    [
      ZakrModel(
        contentTitle:
            'الحمد لله حمدا كثيرا طيبا مباركا فيه غير مَكْفيٍّ ولا مُوَدَّعٍ ولا مُسْتَغْنىً عنه ربنا',
        contentSubTitle:
            'رواه البخاري ،غير مكفي : أي أنه تعالى هو المطعم لعباده والكافي لهم، يستغني عن غيره، وغيره لا يستغني عنه، ولا مودع : أي غير متروك،ولا مستغني عنه : أي غير مطروح ولا معرض عنه بل محتاج إليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle: 'الحمد لله الذي أطعم وسقى وسوغه وجعل له مخرجا',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'الحمد لله الذي أطعمني هذا ورزقنيه من غير حول مني ولا قوة',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم: من أكل طعاما فقال: الحمد لله الذي أطعمني هذا ورزقنيه من غير حول مني ولا قوة، غفر له ما تقدم من ذنبه ،صحيح رواه أبو داود',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'اللهم أطعمت وسقيت، وأغنيت وأقنيت، وهديت وأحييت، فلك الحمد على ما أعطيت',
        contentSubTitle: 'صحيح رواه النسائي في الكبري ،أقنيت : أي أعطيت أصل المال',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[68].title = 'تشميت العاطس',
    titleAndFavor[68].isFavor,
    [
      ZakrModel(
        contentTitle:
            'قال رسول الله صلى الله عليه وسلم : إذا عطس أحدكم فليقل : الحمد لله، وليقل له أخوه أو صاحبه : يرحمك الله، فإذا قال له : يرحمك الله، فليقل : يهديكم الله ويصلح بالكم',
        contentSubTitle: 'رواه البخاري',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[69].title = 'ما يقول عند عقد النكاح',
    titleAndFavor[69].isFavor,
    [
      ZakrModel(
        contentTitle:
            'الحمد لله نستعينه ونستغفره ونعوذ به من شرور أنفسنا، من يهد الله فلا مضل له، ومن يضلل فلا هادي له، وأشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدا عبده ورسوله، (يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها، وبث منهما رجالا كثيرا ونساء، واتقوا الله الذي تساءلون به والأرحام، إن الله كان عليكم رقيبا) (يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون) (يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا يصلح لكم أعمالكم، ويغفر لكم ذنوبكم، ومن يطع الله ورسوله فقد فاز فوزا عظيما)',
        contentSubTitle: 'صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[70].title = 'ما يقال للزوج بعد عقد النكاح',
    titleAndFavor[70].isFavor,
    [
      ZakrModel(
        contentTitle: 'بارك الله لك، وبارك عليك، وجمع بينكما في خير',
        contentSubTitle: 'صحيح رواه أبو داود والترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[71].title = 'ما يقول عند الجماع',
    titleAndFavor[71].isFavor,
    [
      ZakrModel(
        contentTitle: 'بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا',
        contentSubTitle:
            'قال رسول الله صلي الله عليه وسلم لو أن أحدكم إذا أتى أهله قال : بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا فقُضي بينهما ولد لم يضره ،متفق عليه',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[72].title =
        'ما يقول إذا سمع صياح الديك ونهيق الحمار ونباح الكلب',
    titleAndFavor[72].isFavor,
    [
      ZakrModel(
        contentTitle:
            'إذا سمعتم نُهَاقَ الحمير فقولوا أعوذ بالله من الشيطان الرجيم\n وإذا سمعتم صياح الديكة فقل اللهم إني اسالك من فضلك',
        contentSubTitle:
            'قال رسول الله صلي الله عليه وسلم إذا سمعتم نُهَاقَ الحمير فتعوذوا بالله من الشيطان، فإنها رأت شيطانا، وإذا سمعتم صياح الديكة فاسألوا الله من فضله فإنها رأت ملكا ،متفق عليه',
        counter: 1,
      ),
      ZakrModel(
        contentTitle:
            'إذا سمعتم نباح الكلاب ونهيق الحمير بالليل فقل أعوذ بالله من الشيطان الرجيم',
        contentSubTitle:
            'وقال رسول الله صلي الله عليه وسلم إذا سمعتم نباح الكلاب ونهيق الحمير بالليل فتعوذوا بالله، فإنهن يَرَيْنَ ما لا ترون ،صحيح رواه البخاري في الادب المفرد',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[73].title = 'ما يقول عند القيام من المجلس',
    titleAndFavor[73].isFavor,
    [
      ZakrModel(
        contentTitle:
            'سبحانك اللهم وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك وأتوب إليك',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : من جلس في مجلس فكثر فيه لغطه فقال قبل أن يقوم من مجلسه ذلك... إلا غفر له ما كان في مجلسه ذلك ،صحيح رواه الترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[74].title = 'دعاء الجالس في المجلس لنفسه ومن معه',
    titleAndFavor[74].isFavor,
    [
      ZakrModel(
        contentTitle:
            'اللهم اقسم لنا من خشيتك ما تحول به بيننا وبين معاصيك، ومن طاعتك ما تبلغنا به جنتك، ومن اليقين ما تهون به علينا مصائب الدنيا، اللهم متعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا، واجعله الوارث منا، واجعل ثأرنا على من ظلمنا، وانصرنا على من عادانا ولا تجعل مصيبتنا في ديننا، ولا تجعل الدنيا أكبر همنا ولا مبلغ علمنا، ولا تسلط علينا من لا يرحمنا',
        contentSubTitle:
            'عن ابن عمر رضي الله عنهما قال: قلما كان رسول الله صلى الله عليه وسلم يقوم من مجلس حتى يدعو بهؤلاء الدعوات لأصحابه... ،حسن رواه الترمذي ،اجعله الوارث منا : أي اجعل السمع والبصر والقوة تبقي معنا في حياتنا فلا نفقدها ما بقينا أحياء',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[75].title = 'ما يقول إذا غضب',
    titleAndFavor[75].isFavor,
    [
      ZakrModel(
        contentTitle: 'أعوذ بالله من الشيطان الرجيم',
        contentSubTitle:
            'عن سليمان بن صرد الصحابي رضي الله عنه قال : كنت جالسا مع النبي صلى الله عليه وسلم ورجلان يستبان، وأحدهما قد احمر وجهه، وانتفخت أوداجه، فقال رسول الله صلى الله عليه وسلم : إني لأعلم كلمة لو قالها لذهب عنه ما يجد، لو قال : أعوذ بالله من الشيطان الرجيم، ذهب منه ما يجد، فقالوا له : أن النبي صلى الله عليه وسلم قال : تعوذ بالله من الشيطان الرجيم، فقال : وهل بي من جنون؟ ،متفق عليه',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[76].title = 'ما يقول إذا رأى مبتلى بمرض أو غيره',
    titleAndFavor[76].isFavor,
    [
      ZakrModel(
        contentTitle:
            'الحمد لله الذي عافاني مما ابتلاك به وفضلني على كثير ممن خلق تفضيلا',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم من رأى مبتلى فقال... لم يصبه ذلك البلاء ،صحيح رواه الترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[77].title = 'ما يقول إذا عثرت دابته',
    titleAndFavor[77].isFavor,
    [
      ZakrModel(
        contentTitle: 'بسم الله',
        contentSubTitle:
            'عن أبي المليح التابعي المشهور عن رجل قال : كنت رديف النبي صلى الله عليه وسلم فعثرت دابته فقلت : تعس الشيطان، فقال : لا تقل تعس الشيطان، فإنك إذا قلت ذلك تعاظم حتى يكون مثل البيت ويقول : بقوتي، ولكن قل : بسم الله، فإنك إذا قلت ذلك تصاغر حتى يكون مثل الذباب ،صحيح رواه أبو داود',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[78].title = 'دعاء الإنسان لمن صنع معروفا إليه',
    titleAndFavor[78].isFavor,
    [
      ZakrModel(
        contentTitle: 'جزاك الله خيرا',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم من صُنِعَ إليه معروف فقال لفاعله : جزاك الله خيرا، فقد أبلغ في الثناء ،صحيح رواه الترمذي',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[79].title = 'ما يقول إذا رأى ما يحب وما يكره',
    titleAndFavor[79].isFavor,
    [
      ZakrModel(
        contentTitle:
            'إذا رأيت ما تحب فقال : الحمد لله الذي بنعمته تتم الصالحات\nوإذا رأيت ما تكره فقال : الحمد لله على كل حال',
        contentSubTitle: 'حسن رواه ابن ماجه',
        counter: 1,
      ),
    ],
  ],
  [
    titleAndFavor[80].title = 'ما يقول ويفعله من تكلم بكلام قبيح',
    titleAndFavor[80].isFavor,
    [
      ZakrModel(
        contentTitle: 'لا إله إلا الله',
        contentSubTitle:
            'قال رسول الله صلى الله عليه وسلم : من حلف فقال في حلفه : واللات والعزى، فليقل : لا إله إلا الله، ومن قال لصاحبه : تعال أقامرك، فليتصدق ،متفق عليه',
        counter: 1,
      ),
    ],
  ],
];
